<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"Staging","backend":"71501174fa43d17e50b7ce4c28079d7d67b0828c08128ae8def3593a891234be","plan_job_ref":"Job Staging Image Build & Push #17 at https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7324403039","plan_hash":"d968b94bc060a76278b7a6ef4d9288dc8b94b3899d6bed30ab09a36f9f129ce1","plan_text_format":"diff","version":"1.39.0"} -->
Terraform plan for __Staging__
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ecs_service.fastapi-service will be created
+   resource "aws_ecs_service" "fastapi-service" {
+       cluster                            = "arn:aws:ecs:eu-central-1:806066816337:cluster/fastapi-cluster"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "fastapi-service"
+       platform_version                   = (known after apply)
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = "arn:aws:ecs:eu-central-1:806066816337:task-definition/fastapi-docker-image:2"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       network_configuration {
+           assign_public_ip = true
+           security_groups  = [
+               "sg-0ac5d9e923d0871aa",
            ]
+           subnets          = (sensitive value)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Staging Image Build & Push #17](https://github.com/IrezD/python-fastAPI-docker-image/actions/runs/7324403039)